---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyMultidayFrameValue
source: html/a9e74b2c-e775-2bb8-62fa-9674f7844993.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyMultidayFrameValue Property

"Multi-day frame"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyMultidayFrameValue { get; }
```